import React from "react";
import "./Questions.css";

const faq = [
  {
    link: "/",
    question:
      "Які основні визначні місця Одеси варто відвідати під час поїздки?",
    answer:
      "У Одесі варто відвідати Приморський бульвар, Потьомкінські сходи, Одеський оперний театр, Дерибасівську вулицю та Одеський порт.",
  },
  {
    link: "/",
    question: "Як дістатися до Одеси з інших міст України?",
    answer:
      "З інших міст України до Одеси можна дістатися потягом, автобусом, автомобілем або літаком. У Одесі добре розвинута транспортна інфраструктура.",
  },
  {
    link: "/",
    question: "Які традиційні страви Одеси варто спробувати?",
    answer:
      "У Одесі варто спробувати такі традиційні страви, як одеський шуба (салат), форшмак, чорний хліб з салом, котлети по-одеськи та морозиво з місцевої кондитерської.",
  },
  {
    link: "/",
    question: "Які культурні події і фестивалі проходять в Одесі?",
    answer:
      "У Одесі регулярно проходять культурні події і фестивалі, включаючи Одеський кінофестиваль, Одеський міжнародний літературний фестиваль, фестиваль художньої майстерні та багато інших.",
  },
  {
    link: "/",
    question: "Які пляжі в Одесі найбільш популярні серед туристів?",
    answer:
      "Серед популярних пляжів Одеси можна виділити Аркадію, Ланжерон і Золоті піски. Ці пляжі обладнані всім необхідним для відпочинку та мають розвинуту інфраструктуру.",
  },
];

const Questions = () => {
  return (
    <div>
      <h2>frequently asked Questions</h2>

      <ul>
        {faq.map((item) => (
          <li key="first">
            <h4>{item.question}</h4>
            <p>{item.answer}</p>
          </li>
        ))}
      </ul>
    </div>
  );
};

export default Questions;
